# Υλοποίηση του αλγορίθμου δυαδικής αναζήτησης σε ένα ταξινομημένο πίνακα χωρίς αναδρομή.
# Η συνάρτηση binary_search δέχεται ως παραμέτρους τον πίνακα array και το στοιχείο x που θέλουμε να βρούμε.
# Η συνάρτηση χρησιμοποιεί δύο δείκτες, start και finish, για να καθορίσει το τμήμα του πίνακα στο οποίο θα γίνει η αναζήτηση.
# Ενώ ο δείκτης start είναι μικρότερος ή ίσος με τον δείκτη finish, υπολογίζει το μέσο του τμήματος και συγκρίνει το στοιχείο x με το στοιχείο στη θέση middle.
# Αν είναι ίσα, επιστρέφει τη θέση middle. 
# Αν x είναι μικρότερο, μετακινεί τον δείκτη finish στο middle - 1 για να αναζητήσει στο αριστερό μισό του πίνακα. 
# Αν x είναι μεγαλύτερο, μετακινεί τον δείκτη start στο middle + 1 για να αναζητήσει στο δεξί μισό του πίνακα. 
# Αν τα όρια start και finish διασταυρωθούν, επιστρέφει -1, υποδεικνύοντας ότι το στοιχείο δεν βρέθηκε.
#ΔΟΥΛΕΥΕΙ ΜΟΝΟ ΣΕ ΤΑΞΙΝΟΜΗΜΕΝΟ ΠΙΝΑΚΑ!!!!
def binary_search(array, x):
    start = 0                           
    finish = len(array)-1

    while start <= finish:                  # Ενώ τα όρια δεν διασταυρωθούν
        middle = (start + finish) // 2      # Υπολογισμός του μέσου δείκτη
        if array[middle] == x:              # Αν το στοιχείο στη μέση είναι αυτό που ψάχνουμε, επιστρέφουμε τη θέση του
            return middle                   
        elif array[middle] > x:             # Αν το στοιχείο που ψάχνουμε είναι μικρότερο από αυτό στη μέση, μετακινούμε το όριο finish στο middle - 1 για να αναζητήσουμε στο αριστερό μισό του πίνακα
            finish = middle - 1
        else:                               # Αν το στοιχείο που ψάχνουμε είναι μεγαλύτερο από αυτό στη μέση, μετακινούμε το όριο start στο middle + 1 για να αναζητήσουμε στο δεξί μισό του πίνακα
            start = middle + 1
    else:
        return -1



my_list = [i*i for i in range(10)]
print(my_list)
print(binary_search(my_list, 4))