# Bubble Sort
# Ο αλγόριθμος ταξινόμησης φυσαλίδας (Bubble Sort) είναι ένας απλός αλγόριθμος ταξινόμησης που λειτουργεί με την εξής λογική:
# 1. Συγκρίνει κάθε ζεύγος γειτονικών στοιχείων και ανταλλάσσει τα στοιχεία αν είναι στη λάθος σειρά (δηλαδή, αν το πρώτο στοιχείο είναι μεγαλύτερο από το δεύτερο).
# 2. Επαναλαμβάνει αυτή τη διαδικασία για κάθε ζεύγος στοιχείων μέχρι να περάσει ολόκληρος ο πίνακας χωρίς να γίνει καμία ανταλλαγή, που σημαίνει ότι ο πίνακας είναι πλέον ταξινομημένος.
# Ο αλγόριθμος αυτός έχει χρόνο εκτέλεσης O(n^2) και δεν είναι ο πιο αποδοτικός για μεγάλα σύνολα δεδομένων, αλλά είναι εύκολος στην κατανόηση και υλοποίηση.
def bubble_sort(array):
    n = len(array)
    for i in range(n):
        for j in range(n-1,i,-1):
            if array[j] < array[j-1]:
                array[j], array[j-1] = array[j-1], array[j]


ar = [9,2,4,7,1,8,6,3]
bubble_sort(ar)
print(ar)