# Merge Sort
# Ο αλγόριθμος ταξινόμησης συγχώνευσης (Merge Sort) είναι ένας αποδοτικός αλγόριθμος ταξινόμησης που βασίζεται στην τεχνική "διαίρει και βασίλευε".
# Η βασική ιδέα του Merge Sort είναι να χωρίσει τον πίνακα σε δύο υποπίνακες, να ταξινομήσει κάθε υποπίνακα ξεχωριστά και στη συνέχεια να συγχωνεύσει τους δύο ταξινομημένους υποπίνακες σε έναν ενιαίο ταξινομημένο πίνακα.
# Ο αλγόριθμος αυτός έχει χρόνο εκτέλεσης O(n log n) και είναι ιδιαίτερα αποδοτικός για μεγάλα σύνολα δεδομένων.
# Ο αλγόριθμος Merge Sort αποτελείται από δύο βασικά βήματα:
# 1. Διαίρεση: Ο πίνακας χωρίζεται σε δύο υποπίνακες μέχρι να φτάσουμε σε υποπίνακες με ένα μόνο στοιχείο (ή κανένα στοιχείο), που θεωρούνται ήδη ταξινομημένοι.
# 2. Συγχώνευση: Οι ταξινομημένοι υποπίνακες συγχωνεύονται με τέτοιο τρόπο ώστε να διατηρείται η ταξινόμηση, δημιουργώντας έναν νέο ταξινομημένο πίνακα.

from random import randrange

def merge_sort(array):
    def merge(array, start, finish):            # Η συνάρτηση merge συγχωνεύει δύο ταξινομημένους υποπίνακες σε έναν ενιαίο ταξινομημένο πίνακα.
        C = []

        middle = (start+finish)//2
        i=start
        n=middle
        j=middle+1
        m=finish

        while i<=n and j<=m:                    # Ενώ υπάρχουν στοιχεία και στους δύο υποπίνακες, συγκρίνει τα τρέχοντα στοιχεία των δύο υποπινάκων και προσθέτει το μικρότερο από τα δύο στο νέο πίνακα C.
            if array[i] < array[j]:             # Αν το στοιχείο του πρώτου υποπίνακα είναι μικρότερο, προσθέτει αυτό στο C και μετακινεί τον δείκτη i στον πρώτο υποπίνακα.
                C += [array[i]]
                i += 1
            else:
                C += [array[j]]
                j +=1

        if i == n+1:                            # Αν ο πρώτος υποπίνακας έχει εξαντληθεί, προσθέτει τα υπόλοιπα στοιχεία του δεύτερου υποπίνακα στο C.
            C += array[j:m+1]
        else:                                   # Αν ο δεύτερος υποπίνακας έχει εξαντληθεί, προσθέτει τα υπόλοιπα στοιχεία του πρώτου υποπίνακα στο C.
            C += array[i:n+1]

        i = start
        j = 0
        while i<=finish:
            array[i] = C[j]
            i+=1
            j+=1

    def merge_sort_rec(array,start, finish):        # Η συνάρτηση merge_sort_rec είναι η αναδρομική συνάρτηση που υλοποιεί τη λογική του Merge Sort.
        if start == finish:                         # Αν ο πίνακας έχει μόνο ένα στοιχείο, θεωρείται ήδη ταξινομημένος και επιστρέφει χωρίς να κάνει τίποτα.
            return
        elif start == finish-1:                     # Αν ο πίνακας έχει δύο στοιχεία, συγκρίνει τα δύο στοιχεία και τα ανταλλάσσει αν είναι στη λάθος σειρά.
            if array[start] > array[finish]:
                array[start], array[finish] = array[finish], array[start]
        else:                                       # Αν ο πίνακας έχει περισσότερα από δύο στοιχεία, χωρίζει τον πίνακα σε δύο υποπίνακες, καλεί αναδρομικά τη συνάρτηση για κάθε υποπίνακα και στη συνέχεια συγχωνεύει τους δύο ταξινομημένους υποπίνακες χρησιμοποιώντας τη συνάρτηση merge.
            middle = (start+finish)//2
            merge_sort_rec(array,start,middle)
            merge_sort_rec(array,middle+1,finish)
            merge(array,start,finish)

    merge_sort_rec(array,0,len(array)-1)

ar = [randrange(100) for _ in range(50)]            # Δημιουργεί έναν πίνακα με 50 τυχαίους ακέραιους αριθμούς από το 0 έως το 99.
merge_sort(ar)
print(ar)
