# Selection Sort
# Ο αλγόριθμος ταξινόμησης επιλογής (Selection Sort) είναι ένας απλός αλγόριθμος ταξινόμησης που λειτουργεί με την εξής λογική:
# 1. Ξεκινάει από το πρώτο στοιχείο του πίνακα και θεωρεί ότι είναι το μικρότερο.
# 2. Συγκρίνει αυτό το στοιχείο με όλα τα υπόλοιπα στοιχεία του πίνακα για να βρει το πραγματικά μικρότερο στοιχείο.
# 3. Αν βρει ένα μικρότερο στοιχείο, το σημειώνει ως το νέο μικρότερο.
# 4. Μετά από τη σύγκριση με όλα τα στοιχεία, ανταλλάσσει το μικρότερο στοιχείο με το πρώτο στοιχείο του πίνακα.
# 5. Επαναλαμβάνει τη διαδικασία για το υπόλοιπο του πίνακα, ξεκινώντας από το δεύτερο στοιχείο, και συνεχίζει μέχρι να ταξινομηθεί ολόκληρος ο πίνακας.
# Ο αλγόριθμος αυτός έχει χρόνο εκτέλεσης O(n^2) και δεν είναι ο πιο αποδοτικός για μεγάλα σύνολα δεδομένων, αλλά είναι εύκολος στην κατανόηση και υλοποίηση.
def selection_sort(array):
    for i in range(0, len(array)):

        pos = i
        for j in range(i+1, len(array)):
            if array[j] < array[pos]:
                pos = j

        array[i], array[pos] = array[pos], array[i]


array = [1, 5, 2 , 8, 4, 7, 3, 9, 6]
selection_sort(array)
print(array)